app/views/projects/_form.html.erb

		<%= f.label :company_id %>
		<%= f.collection_select(:company_id, Company.all, :id, :name, prompt: true) %>
---
SELECT "companies".* FROM "companies"