app/views/projects/show.html.erb


<%if @project.works.size > 0%>
---
SELECT "works".* FROM "works" WHERE "works"."project_id" = ?  [["project_id", 463626445]]