app/views/companies/show.html.erb

<p><%= link_to 'Edit Company', edit_company_path(@company) %></p>
<% if @company.projects.size > 0 %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."company_id" = ?  [["company_id", 508864041]]