app/controllers/companies_controller.rb

	def create
		@company = Company.new(params[:company].permit(:name))
		if @company.save
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Adobe"], ["created_at", "2015-06-11 21:42:14.643871"], ["updated_at", "2015-06-11 21:42:14.643871"]]