app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."slug" = ? LIMIT 1  [["slug", "project-xyz"]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 463626445]]
---
	def show
		if (params[:slug])
			@project = Project.find_by slug: params[:slug]
		else
			@project = Project.find(params[:id])

INSERT INTO "projects" ("name", "default_rate", "slug", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "project1"], ["default_rate", 55], ["slug", "project1"], ["company_id", 508864041], ["created_at", "2015-06-11 21:55:22.521559"], ["updated_at", "2015-06-11 21:55:22.521559"]]
---
	def create
		@project = Project.new(params[:project].permit(:name,:default_rate,:slug,:company_id))
		if @project.save