app/controllers/works_controller.rb

SELECT "works".* FROM "works" WHERE (dateimperformed>'2015-05-17 16:10:29 -0400')  ORDER BY dateimperformed desc
---
def index
	if (params[:days])
		@works = Work.recentdays(params[:days]).order('dateimperformed desc')

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT 1  [["id", 190738503]]
---
	def show
		@work = Work.find(params[:id])

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT 1  [["id", 478980561]]
---
	def edit
		@work = Work.find(params[:id])